import Card from 'src/components/Cards/Card.vue'
import LTable from 'src/components/Table.vue'

const tableColumns = ['รหัสทรัพย์สิน', 'รายละเอียด', 'serial', 'รหัสพนักงาน', 'ผู้ครอบครอง', 'สถานที่ติดตั้ง', 'รหัสต้นทุน', 'วันที่รับ', 'มูลค่าแรกเข้า', 'มูลค่าคงเหลือ']
  const tableData = [
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },
    {
      รหัสทรัพย์สิน: 1,
      รายละเอียด: 'Dakota Rice',
      serial: '$36.738',
      รหัสพนักงาน: 'Niger',
      ผู้ครอบครอง: '$36.738',
      สถานที่ติดตั้ง: 'Dakota Rice',
      รหัสต้นทุน: '$36.738',
      วันที่รับ: 'Niger',
      มูลค่าแรกเข้า: 'Niger',
      มูลค่าคงเหลือ: 'Oud-Turnhout'
    },

  ]
export default {
  name: 'data-table',
  components: {
    LTable,
    Card
  },
  props: [],
  data () {
    return {
        table1: {
          columns: [...tableColumns],
          data: [...tableData]
        },
    }
  },
  computed: {

  },
  mounted () {
//console.log("555");
  },
  methods: {

  }
}


